#CLI
brew "git"
brew "gh"            
brew "mise"          
brew "fzf"           
brew "tmux"          
brew "neovim"        
brew "lazygit"       
brew "yazi"       
brew "bat"  
brew "eza"       
brew "ripgrep"    
brew "fd"         
brew "delta"
brew "jq"
brew "zoxide"
brew "stow"
brew "awscli"
brew "llvm"
brew "protobuf"
brew "cmake"
brew "hyperfine"
brew "grpcurl"

#GUI
cask "ghostty"
cask "visual-studio-code"
cask "raycast"
cask "notion"
cask "slack"
cask "figma"
cask "google-chrome"
cask "docker-desktop"
cask "font-jetbrains-mono-nerd-font"
cask "gcloud-cli"
