#CLI
brew "git"
brew "gh"            
brew "mise"          
brew "fzf"           
brew "tmux"          
brew "neovim"        
brew "lazygit"       
brew "yazi"       
brew "bat"  
brew "eza"       
brew "ripgrep"    
brew "fd"         
brew "delta"
brew "jq"
brew "httpie"
brew "zoxide"
brew "stow"
brew "wget"
brew "readline" #ruby依存
brew "libyaml"  #ruby依存
brew "gmp"      #ruby依存


#GUI
cask "ghostty"
cask "visual-studio-code"
cask "raycast" 
cask "notion" 
cask "slack" 
cask "figma" 
cask "font-jetbrains-mono-nerd-font"
cask "font-jetbrains-mono"
